Revit 2025 API
LightDimmingColor Enumeration
 Tags for specific light dimming colors
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum LightDimmingColor
Public Enumeration LightDimmingColor
public enum class LightDimmingColor
type LightDimmingColor
Members
Member name | Value | Description
None | 0 |  No dimming color.
Incandescent | 1 |  Incandescent lamp curve dimming color.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace